package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_uk {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_am", "дп|ранку");
            put("param_pm", "дня|ночі|пп|дня|пп");
            put("param_MMM", "січ\\.|лют\\.|бер\\.|квіт\\.|трав\\.|черв\\.|лип\\.|серп\\.|вер\\.|жовт\\.|лист\\.|груд\\.");
            put("param_MMMM", "січня|лютого|березня|квітня|травня|червня|липня|серпня|вересня|жовтня|листопада|грудня");
            put("param_E", "Нд|Пн|Вт|Ср|Чт|Пт|Сб");
            put("param_E2", "Нд|Пн|Вт|Ср|Чт|Пт|Сб");
            put("param_EEEE", "неділя|понеділок|вівторок|середа|четвер|пʼятниця|субота");
            put("param_days", "сьогодні|завтра|післязавтра");
            put("param_thisweek", "цієї\\s+неділі|цього\\s+понеділка|цього\\s+вівторка|цієї\\s+середи|цього\\s+четверга|цієї\\s+п’ятниці|цієї\\s+суботи");
            put("param_nextweek", "наступної\\s+неділі|наступного\\s+понеділка|наступного\\s+вівторка|наступної\\s+середи|наступного\\s+четверга|наступної\\s+п’ятниці|наступної\\s+суботи");
        }
    };
}
