package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_km {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "ព្រឹក");
            put("param_pm", "ល្ងាច");
            put("param_MMM", "មករា|កុម្ភៈ|មីនា|មេសា|ឧសភា|មិថុនា|កក្កដា|សីហា|កញ្ញា|តុលា|វិច្ឆិកា|ធ្នូ");
            put("param_MMMM", "ខែមករា|ខែកុម្ភៈ|ខែមីនា|ខែមេសា|ខែឧសភា|ខែមិថុនា|ខែកក្កដា|ខែសីហា|ខែកញ្ញា|ខែតុលា|ខែវិច្ឆិកា|ខែធ្នូ");
            put("param_E", "អាទិត្យ|ច័ន្ទ|អង្គារ|ពុធ|ព្រហស្បតិ៍|សុក្រ|សៅរ៍");
            put("param_E2", "អាទិត្យ|ច័ន្ទ|អង្គារ|ពុធ|ព្រហស្បតិ៍|សុក្រ|សៅរ៍");
            put("param_EEEE", "ថ្ងៃអាទិត្យ|ថ្ងៃច័ន្ទ|ថ្ងៃអង្គារ|ថ្ងៃពុធ|ថ្ងៃព្រហស្បតិ៍|ថ្ងៃសុក្រ|ថ្ងៃសៅរ៍");
            put("param_days", "ថ្ងៃ​នេះ|ថ្ងៃ​ស្អែក|​ខាន​ស្អែក");
            put("param_thisweek", "ថ្ងៃ​អាទិត្យ​នេះ|ថ្ងៃ​ច័ន្ទ​នេះ|ថ្ងៃ​អង្គារ​នេះ|ថ្ងៃ​ពុធ​នេះ|ថ្ងៃ​ព្រហស្បតិ៍​នេះ|ថ្ងៃ​សុក្រ​នេះ|ថ្ងៃ​សៅរ៍​នេះ");
            put("param_nextweek", "ថ្ងៃ​អាទិត្យ​ក្រោយ|ថ្ងៃ​ច័ន្ទ​ក្រោយ|ថ្ងៃ​អង្គារ​ក្រោយ|ថ្ងៃ​ពុធ​ក្រោយ|ថ្ងៃ​ព្រហស្បតិ៍​ក្រោយ|ថ្ងៃ​សុក្រ​ក្រោយ|ថ្ងៃ​សៅរ៍​ក្រោយ");
        }
    };
}
