package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_ar {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_am", "ص");
            put("param_pm", "م");
            put("param_MMM", "يناير|فبراير|مارس|أبريل|مايو|يونيو|يوليو|أغسطس|سبتمبر|أكتوبر|نوفمبر|ديسمبر");
            put("param_MMMM", "يناير|فبراير|مارس|أبريل|مايو|يونيو|يوليو|أغسطس|سبتمبر|أكتوبر|نوفمبر|ديسمبر");
            put("param_E", "الأحد|الاثنين|الثلاثاء|الأربعاء|الخميس|الجمعة|السبت");
            put("param_E2", "الأحد|الاثنين|الثلاثاء|الأربعاء|الخميس|الجمعة|السبت");
            put("param_EEEE", "الأحد|الاثنين|الثلاثاء|الأربعاء|الخميس|الجمعة|السبت");
            put("param_days", "اليوم|غدًا|بعد\\s+الغد");
            put("param_thisweek", "الأحد\\s+الحالي|الاثنين\\s+الحالي|الثلاثاء\\s+الحالي|الأربعاء\\s+الحالي|الخميس\\s+الحالي|الجمعة\\s+الحالية|السبت\\s+الحالي");
            put("param_nextweek", "الأحد\\s+التالي|الاثنين\\s+التالي|الثلاثاء\\s+التالي|الأربعاء\\s+التالي|الخميس\\s+التالي|الجمعة\\s+التالية|السبت\\s+التالي");
        }
    };
}
