package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_lo {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "ເຊົ້າ|ຕອນເຊົ້າ|ທ່ຽງ");
            put("param_pm", "ແລງ|ກາງຄືນ|ຕອນບ່າຍ|ຕອນແລງ");
            put("param_MMM", "ມ\\.ກ\\.|ກ\\.ພ\\.|ມ\\.ນ\\.|ມ\\.ສ\\.|ພ\\.ພ\\.|ມ\\.ຖ\\.|ກ\\.ລ\\.|ສ\\.ຫ\\.|ກ\\.ຍ\\.|ຕ\\.ລ\\.|ພ\\.ຈ\\.|ທ\\.ວ\\.");
            put("param_MMMM", "ມັງກອນ|ກຸມພາ|ມີນາ|ເມສາ|ພຶດສະພາ|ມິຖຸນາ|ກໍລະກົດ|ສິງຫາ|ກັນຍາ|ຕຸລາ|ພະຈິກ|ທັນວາ");
            put("param_E", "\\bທິດ\\b|\\bຈັນ\\b|\\bຄານ\\b|\\bພຸດ\\b|\\bພະຫັດ\\b|\\bສຸກ\\b|\\bເສົາ\\b ");
            put("param_E2", "\\bທິດ\\b|\\bຈັນ\\b|\\bຄານ\\b|\\bພຸດ\\b|\\bພະຫັດ\\b|\\bສຸກ\\b|\\bເສົາ\\b");
            put("param_EEEE", "ວັນອາທິດ|ວັນຈັນ|ວັນອັງຄານ|ວັນພຸດ|ວັນພະຫັດ|ວັນສຸກ|ວັນເສົາ");
            put("param_days", "ມື້ນີ້|ມື້ອື່ນ|ມື້ຮື");
            put("param_thisweek", "ວັນອາທິດນີ້|ວັນຈັນນີ້|ວັນອັງຄານນີ້|ວັນພຸດນີ້|ວັນພະຫັດນີ້|ວັນສຸກນີ້|ວັນເສົານີ້");
            put("param_nextweek", "ວັນອາທິດໜ້າ|ວັນຈັນໜ້າ|ວັນອັງຄານໜ້າ|ວັນພຸດໜ້າ|ວັນພະຫັດໜ້າ|ວັນສຸກໜ້າ|ວັນເສົາໜ້າ");
        }
    };
}
