package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_ta {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "முற்பகல்");
            put("param_pm", "பிற்பகல்");
            put("param_MMM", "ஜன\\.|பிப்\\.|மார்\\.|ஏப்\\.|மே|ஜூன்|ஜூலை|ஆக\\.|செப்\\.|அக்\\.|நவ\\.|டிச\\.");
            put("param_MMMM", "ஜனவரி|பிப்ரவரி|மார்ச்|ஏப்ரல்|மே|ஜூன்|ஜூலை|ஆகஸ்ட்|செப்டம்பர்|அக்டோபர்|நவம்பர்|டிசம்பர்");
            put("param_E", "ஞாயி\\.|திங்\\.|செவ்\\.|புத\\.|வியா\\.|வெள்\\.|சனி");
            put("param_E2", "ஞாயி\\.|திங்\\.|செவ்\\.|புத\\.|வியா\\.|வெள்\\.|சனி");
            put("param_EEEE", "ஞாயிறு|திங்கள்|செவ்வாய்|புதன்|வியாழன்|வெள்ளி|சனி");
            put("param_days", "இன்று|நாளை|நாளை\\s+மறுநாள்");
            put("param_thisweek", "இந்த\\s+ஞாயிறு|இந்த\\s+திங்கள்|இந்த\\s+செவ்வாய்|இந்த\\s+புதன்|இந்த\\s+வியாழன்|இந்த\\s+வெள்ளி|இந்த\\s+சனி");
            put("param_nextweek", "அடுத்த\\s+ஞாயிறு|அடுத்த\\s+திங்கள்|அடுத்த\\s+செவ்வாய்|அடுத்த\\s+புதன்|அடுத்த\\s+வியாழன்|அடுத்த\\s+வெள்ளி|அடுத்த\\s+சனி");
        }
    };
}
