package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_mk {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "AM");
            put("param_pm", "PM");
            put("param_MMM", "јан\\.|фев\\.|мар\\.|апр\\.|мај|јун\\.|јул\\.|авг\\.|септ\\.|окт\\.|ноем\\.|дек\\.");
            put("param_MMMM", "јануари|февруари|март|април|мај|јуни|јули|август|септември|октомври|ноември|декември");
            put("param_E", "нед\\.|пон\\.|вто\\.|сре\\.|чет\\.|пет\\.|саб\\.");
            put("param_E2", "нед\\.|пон\\.|вто\\.|сре\\.|чет\\.|пет\\.|саб\\.");
            put("param_EEEE", "недела|понеделник|вторник|среда|четврток|петок|сабота");
            put("param_days", "денес|утре|задутре");
            put("param_thisweek", "оваа\\s+недела|овој\\s+понеделник|овој\\s+вторник|оваа\\s+среда|овој\\s+четврток|овој\\s+петок|оваа\\s+сабота");
            put("param_nextweek", "следната\\s+недела|следниот\\s+понеделник|следниот\\s+вторник|следната\\s+среда|следниот\\s+четврток|следниот\\s+петок|следната\\s+сабота");
        }
    };
}
