package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_el {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_am", "π\\.μ\\.|πμ");
            put("param_pm", "μ\\.μ\\.|μμ");
            put("param_MMM", "Ιαν|Φεβ|Μαρ|Απρ|Μαΐ|Ιουν|Ιουλ|Αυγ|Σεπ|Οκτ|Νοε|Δεκ");
            put("param_MMMM", "Ιανουαρίου|Φεβρουαρίου|Μαρτίου|Απριλίου|Μαΐου|Ιουνίου|Ιουλίου|Αυγούστου|Σεπτεμβρίου|Οκτωβρίου|Νοεμβρίου|Δεκεμβρίου");
            put("param_E", "Κυρ|Δευ|Τρί|Τετ|Πέμ|Παρ|Σάβ");
            put("param_E2", "Κυρ|Δευ|Τρί|Τετ|Πέμ|Παρ|Σάβ");
            put("param_EEEE", "Κυριακή|Δευτέρα|Τρίτη|Τετάρτη|Πέμπτη|Παρασκευή|Σάββατο");
            put("param_days", "σήμερα|αύριο|μεθαύριο");
            put("param_thisweek", "αυτήν\\s+την\\s+Κυριακή|αυτήν\\s+τη\\s+Δευτέρα|αυτήν\\s+την\\s+Τρίτη|αυτήν\\s+την\\s+Τετάρτη|αυτήν\\s+την\\s+Πέμπτη|αυτήν\\s+την\\s+Παρασκευή|αυτό\\s+το\\s+Σάββατο");
            put("param_nextweek", "επόμενη\\s+Κυριακή|επόμενη\\s+Δευτέρα|επόμενη\\s+Τρίτη|επόμενη\\s+Τετάρτη|επόμενη\\s+Πέμπτη|επόμενη\\s+Παρασκευή|επόμενο\\s+Σάββατο");
        }
    };
}
