package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_bn {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "ভোর|সকাল|am");
            put("param_pm", "রাত্রি|সন্ধ্যা|বিকাল|দুপুর|pm");
            put("param_MMM", "জানু\\.|ফেব্রু\\.|মার্চ|এপ্রিল|মে|জুন|জুলাই|অগস্ট|সেপ্টে\\.|অক্টো\\.|নভে\\.|ডিসে\\.");
            put("param_MMMM", "জানুয়ারি|ফেব্রুয়ারি|মার্চ|এপ্রিল|মে|জুন|জুলাই|আগস্ট|সেপ্টেম্বর|অক্টোবর|নভেম্বর|ডিসেম্বর");
            put("param_E", "রবি|সোম|মঙ্গল|বুধ|বৃহস্পতি|শুক্র|শনি");
            put("param_E2", "রবি|সোম|মঙ্গল|বুধ|বৃহস্পতি|শুক্র|শনি");
            put("param_EEEE", "রবিবার|সোমবার|মঙ্গলবার|বুধবার|বৃহস্পতিবার|শুক্রবার|শনিবার");
            put("param_days", "আজ|(আগামী)?কাল|আগামী\\s+পরশু");
            put("param_thisweek", "এই\\s+রবিবার|এই\\s+সোমবার|এই\\s+মঙ্গলবার|এই\\s+বুধবার|এই\\s+বৃহস্পতিবার|এই\\s+শুক্রবার|এই\\s+শনিবার");
            put("param_nextweek", "পরের\\s+রবিবার|পরের\\s+সোমবার|পরের\\s+মঙ্গলবার|পরের\\s+বুধবার|পরের\\s+বৃহস্পতিবার|পরের\\s+শুক্রবার|পরের\\s+শনিবার");
        }
    };
}
