package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_mn {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "ү\\.ө");
            put("param_pm", "ү\\.х");
            put("param_MMM", "1-р\\s+сар|2-р\\s+сар|3-р\\s+сар|4-р\\s+сар|5-р\\s+сар|6-р\\s+сар|7-р\\s+сар|8-р\\s+сар|9-р\\s+сар|10-р\\s+сар|11-р\\s+сар|12-р\\s+сар");
            put("param_MMMM", "Нэгдүгээр\\s+сар|Хоёрдугаар\\s+сар|Гуравдугаар\\s+сар|Дөрөвдүгээр\\s+сар|Тавдугаар\\s+сар|Зургадугаар\\s+сар|Долдугаар\\s+сар|Наймдугаар\\s+сар|Есдүгээр\\s+сар|Аравдугаар\\s+сар|Арван\\s+нэгдүгээр\\s+сар|Арван\\s+хоёрдугаар\\s+сар");
            put("param_E", "Ня|Да|Мя|Лх|Пү|Ба|Бя");
            put("param_E2", "Ня|Да|Мя|Лх|Пү|Ба|Бя");
            put("param_EEEE", "ням|даваа|мягмар|лхагва|пүрэв|баасан|бямба");
            put("param_days", "өнөөдөр|маргааш|нөгөөдөр");
            put("param_thisweek", "энэ\\s+ням\\s+гараг|энэ\\s+даваа\\s+гараг|энэ\\s+мягмар\\s+гараг|энэ\\s+лхагва\\s+гараг|энэ\\s+пүрэв\\s+гараг|энэ\\s+баасан\\s+гараг|энэ\\s+бямба\\s+гараг");
            put("param_nextweek", "ирэх\\s+ням\\s+гараг|ирэх\\s+даваа\\s+гараг|ирэх\\s+мягмар\\s+гараг|ирэх\\s+лхагва\\s+гараг|ирэх\\s+пүрэв\\s+гараг|ирэх\\s+баасан\\s+гараг|ирэх\\s+бямба\\s+гараг");
            put("mark_ShortDateLevel", "ymd");
        }
    };
}
