package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_bg {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_tmark", ":");
            put("param_am", "пр\\.об\\.");
            put("param_pm", "сл\\.об\\.");
            put("param_MMM", "ян\\.|февр\\.|март|апр\\.|май|юни|юли|авг\\.|септ\\.|окт\\.|ноем\\.|дек\\.");
            put("param_MMMM", "януари|февруари|март|април|май|юни|юли|август|септември|октомври|ноември|декември");
            put("param_E", "нд|пн|вт|ср|чт|пт|сб");
            put("param_E2", "нд|пн|вт|ср|чт|пт|сб");
            put("param_EEEE", "неделя|понеделник|вторник|сряда|четвъртък|петък|събота");
            put("param_days", "днес|утре|вдругиден");
            put("param_thisweek", "тази\\s+неделя|този\\s+понеделник|този\\s+вторник|тази\\s+сряда|този\\s+четвъртък|този\\s+петък|тази\\s+събота");
            put("param_nextweek", "следващата\\s+неделя|следващият\\s+понеделник|следващият\\s+вторник|следващата\\s+сряда|следващият\\s+четвъртък|следващият\\s+петък|следващата\\s+събота");
        }
    };
}
