package com.huawei.g11n.tmr.datetime.data;

import java.util.HashMap;

public class LocaleParamGet_th {
    public HashMap<String, String> date = new HashMap<String, String>() {
        {
            put("param_am", "ก่อนเที่ยง");
            put("param_pm", "หลังเที่ยง");
            put("param_MMM", "ม\\.ค\\.|ก\\.พ\\.|มี\\.ค\\.|เม\\.ย\\.|พ\\.ค\\.|มิ\\.ย\\.|ก\\.ค\\.|ส\\.ค\\.|ก\\.ย\\.|ต\\.ค\\.|พ\\.ย\\.|ธ\\.ค\\.");
            put("param_MMMM", "มกราคม|กุมภาพันธ์|มีนาคม|เมษายน|พฤษภาคม|มิถุนายน|กรกฎาคม|สิงหาคม|กันยายน|ตุลาคม|พฤศจิกายน|ธันวาคม");
            put("param_E", "อา\\.|จ\\.|อ\\.|พ\\.|พฤ\\.|ศ\\.|ส\\.");
            put("param_E2", "อา\\.|จ\\.|อ\\.|พ\\.|พฤ\\.|ศ\\.|ส\\.");
            put("param_EEEE", "วันอาทิตย์|วันจันทร์|วันอังคาร|วันพุธ|วันพฤหัสบดี|วันศุกร์|วันเสาร์");
            put("param_days", "วันนี้|พรุ่งนี้|มะรืนนี้");
            put("param_thisweek", "อาทิตย์นี้|จันทร์นี้|อังคารนี้|พุธนี้|พฤหัสนี้|ศุกร์นี้|เสาร์นี้");
            put("param_nextweek", "อาทิตย์หน้า|จันทร์หน้า|อังคารหน้า|พุธหน้า|พฤหัสหน้า|ศุกร์หน้า|เสาร์หน้า");
        }
    };
}
